; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph0 - mode
	infrared1 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star1 - direction
	Star6 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Planet7 infrared1)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 infrared1)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 thermograph0)
	(have_image Planet14 thermograph0)
	(have_image Star15 infrared1)
	(have_image Planet16 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 11
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite1 phenomenon9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 11
5. (take_image satellite1 phenomenon9 instrument3 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 11
7. (take_image satellite1 phenomenon12 instrument3 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 2 of 11
8. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 11
9. (turn_to satellite0 star1 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star1)
   goals met: 3 of 11
10. (take_image satellite1 phenomenon10 instrument3 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 4 of 11
11. (turn_to satellite1 planet14 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet14)
   goals met: 4 of 11
12. (take_image satellite1 planet14 instrument3 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 5 of 11
13. (turn_to satellite1 planet16 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet16)
   goals met: 5 of 11
14. (take_image satellite1 planet16 instrument3 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 6 of 11
15. (turn_to satellite1 planet7 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet7)
   goals met: 6 of 11
16. (take_image satellite1 planet7 instrument3 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 7 of 11
17. (turn_to satellite1 star11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star11)
   goals met: 7 of 11
18. (take_image satellite1 star11 instrument3 infrared1)
   added: (have_image star11 infrared1)
   goals met: 8 of 11
19. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 8 of 11
20. (take_image satellite1 star13 instrument3 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 9 of 11
21. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 9 of 11
22. (take_image satellite1 star15 instrument3 infrared1)
   added: (have_image star15 infrared1)
   goals met: 10 of 11
23. (turn_to satellite1 star8 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star8)
   goals met: 10 of 11
24. (take_image satellite1 star8 instrument3 infrared1)
   added: (have_image star8 infrared1)
   goals met: 11 of 11
